app/controllers/articles_controller.rb

  def show
    @article.increase_number_of_view
    @article.save
---
UPDATE "articles" SET "views" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["views", 4], ["updated_at", "2015-11-30 16:41:16.808450"], ["id", 1]]

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello world"], ["body", "Rails so fast!"], ["created_at", "2015-11-18 09:49:39.258554"], ["updated_at", "2015-11-18 09:49:39.258554"]]